# Задача 2

#Ввод	стандартный ввод
#Вывод	стандартный вывод

# В файле kryto.sqlite записана информация о группах университета:
# id, name, number_of_student, tutor, department
# id, название группы, число студентов, имя куратора группы, название выпускающей кафедры

#Формат ввода
#Сначала вводится строка тех, чьи кураторы нас интересуют (через пробел).
#Затем вводится число – наименьшее число учеников в группе.

#Формат вывода
#Отобрав подходящие по двум условиям записи, выведите название групп (в алфавитном порядке, через запятую и пробел),
#а затем название кафедр также без повторений, по алфавиту, через запятую и пробел.

# Пример

# Ввод
# Anna, Alexandra
# 21

# Вывод
# АВ-11-24, АП-3-21
# Кафедра автоматического управления, Кафедра высшей математики
